; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-6-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-2 - location
	p1-0 - location
	p3-4 - location
	p3-6 - location
	p4-0 - location
	p4-5 - location
	p4-8 - location
	p5-1 - location
	p5-7 - location
	p5-8 - location
	p6-1 - location
	p7-3 - location
	p7-5 - location
	p7-8 - location
	p8-6 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s5)
	(at driver3 s2)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s8)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s2)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s1)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s0)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s0)
	(at package2 s7)
	(at package3 s5)
	(at package4 s5)
	(at package5 s4)
	(at package6 s1)
	(at package7 s5)
	(at package8 s5)
	(at package9 s7)
	(at package10 s3)
	(at package11 s0)
	(at package12 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 42)
	(= (time-to-drive s3 s0) 42)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 45)
	(= (time-to-drive s5 s0) 45)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 18)
	(= (time-to-drive s7 s0) 18)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 25)
	(= (time-to-drive s2 s1) 25)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 96)
	(= (time-to-drive s0 s2) 96)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 59)
	(= (time-to-drive s6 s2) 59)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 76)
	(= (time-to-drive s8 s2) 76)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 6)
	(= (time-to-drive s1 s3) 6)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 17)
	(= (time-to-drive s2 s3) 17)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 71)
	(= (time-to-drive s0 s4) 71)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 64)
	(= (time-to-drive s1 s4) 64)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 4)
	(= (time-to-drive s5 s4) 4)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 17)
	(= (time-to-drive s7 s4) 17)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 39)
	(= (time-to-drive s4 s6) 39)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 12)
	(= (time-to-drive s8 s6) 12)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 88)
	(= (time-to-drive s1 s7) 88)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 79)
	(= (time-to-drive s2 s7) 79)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 76)
	(= (time-to-drive s5 s7) 76)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 25)
	(= (time-to-drive s6 s7) 25)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 79)
	(= (time-to-drive s8 s7) 79)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 25)
	(= (time-to-drive s4 s8) 25)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s8)
	(at driver3 s6)
	(at truck1 s0)
	(at truck2 s6)
	(at truck3 s3)
	(at truck5 s1)
	(at truck6 s3)
	(at package2 s3)
	(at package3 s8)
	(at package4 s1)
	(at package5 s2)
	(at package6 s1)
	(at package7 s5)
	(at package8 s7)
	(at package9 s8)
	(at package10 s0)
	(at package11 s0)
	(at package12 s7)
	))

(:metric minimize (+ (* 2 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver2 s5 p5-8)
   deleted: (at driver2 s5)
   added: (at driver2 p5-8)
   goals met: 5 of 19
2. (walk driver1 s5 p5-1)
   deleted: (at driver1 s5)
   added: (at driver1 p5-1)
   goals met: 5 of 19
3. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 5 of 19
4. (drive-truck truck4 s2 s0 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 0 to 960
   goals met: 5 of 19
5. (walk driver2 p5-8 s8)
   deleted: (at driver2 p5-8)
   added: (at driver2 s8)
   goals met: 6 of 19
6. (walk driver1 p5-1 s1)
   deleted: (at driver1 p5-1)
   added: (at driver1 s1)
   goals met: 6 of 19
7. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 19
8. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 6 of 19
9. (drive-truck truck1 s1 s7 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   changed: (fuel-used) from 960 to 1840
   goals met: 6 of 19
10. (load-truck package2 truck1 s7)
   deleted: (at package2 s7)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 19
11. (board-truck driver3 truck6 s0)
   deleted: (at driver3 s0) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 6 of 19
12. (board-truck driver2 truck2 s8)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 19
13. (load-truck package9 truck1 s7)
   deleted: (at package9 s7)
   added: (in package9 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 5 of 19
14. (drive-truck truck6 s0 s3 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (fuel-used) from 1840 to 2260
   goals met: 6 of 19
15. (load-truck package10 truck6 s3)
   deleted: (at package10 s3)
   added: (in package10 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 6 of 19
16. (drive-truck truck6 s3 s2 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   changed: (fuel-used) from 2260 to 2447
   goals met: 5 of 19
17. (disembark-truck driver2 truck2 s8)
   deleted: (driving driver2 truck2)
   added: (at driver2 s8) (empty truck2)
   goals met: 6 of 19
18. (drive-truck truck6 s2 s6 driver3)
   deleted: (at truck6 s2)
   added: (at truck6 s6)
   changed: (fuel-used) from 2447 to 3096
   goals met: 6 of 19
19. (disembark-truck driver3 truck6 s6)
   deleted: (driving driver3 truck6)
   added: (at driver3 s6) (empty truck6)
   goals met: 7 of 19
20. (unload-truck package10 truck6 s6)
   deleted: (in package10 truck6)
   added: (at package10 s6)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 7 of 19
21. (drive-truck truck1 s7 s4 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (fuel-used) from 3096 to 3317
   goals met: 7 of 19
22. (load-truck package5 truck1 s4)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 7 of 19
23. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 3317 to 4453
   goals met: 8 of 19
24. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 4453 to 5989
   goals met: 7 of 19
25. (unload-truck package5 truck1 s2)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 8 of 19
26. (drive-truck truck1 s2 s8 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   changed: (fuel-used) from 5989 to 6977
   goals met: 8 of 19
27. (unload-truck package9 truck1 s8)
   deleted: (in package9 truck1)
   added: (at package9 s8)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 9 of 19
28. (drive-truck truck1 s8 s7 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   changed: (fuel-used) from 6977 to 7846
   goals met: 9 of 19
29. (board-truck driver3 truck6 s6)
   deleted: (at driver3 s6) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 8 of 19
30. (drive-truck truck1 s7 s0 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   changed: (fuel-used) from 7846 to 8044
   goals met: 9 of 19
31. (load-truck package10 truck6 s6)
   deleted: (at package10 s6)
   added: (in package10 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 9 of 19
32. (drive-truck truck1 s0 s7 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (fuel-used) from 8044 to 8242
   goals met: 8 of 19
33. (drive-truck truck6 s6 s2 driver3)
   deleted: (at truck6 s6)
   added: (at truck6 s2)
   changed: (fuel-used) from 8242 to 8891
   goals met: 8 of 19
34. (drive-truck truck6 s2 s7 driver3)
   deleted: (at truck6 s2)
   added: (at truck6 s7)
   changed: (fuel-used) from 8891 to 9760
   goals met: 8 of 19
35. (drive-truck truck1 s7 s0 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   changed: (fuel-used) from 9760 to 9958
   goals met: 9 of 19
36. (drive-truck truck1 s0 s3 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 9958 to 10420
   goals met: 8 of 19
37. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 19
38. (drive-truck truck1 s3 s0 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 10420 to 10840
   goals met: 10 of 19
39. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 10 of 19
40. (drive-truck truck6 s7 s0 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s0)
   changed: (fuel-used) from 10840 to 11038
   goals met: 10 of 19
41. (unload-truck package10 truck6 s0)
   deleted: (in package10 truck6)
   added: (at package10 s0)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 11 of 19
42. (drive-truck truck6 s0 s5 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s5)
   changed: (fuel-used) from 11038 to 11488
   goals met: 11 of 19
43. (load-truck package3 truck6 s5)
   deleted: (at package3 s5)
   added: (in package3 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 11 of 19
44. (load-truck package4 truck6 s5)
   deleted: (at package4 s5)
   added: (in package4 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 11 of 19
45. (load-truck package8 truck6 s5)
   deleted: (at package8 s5)
   added: (in package8 truck6)
   changed: (load truck6) from 2 to 3, (fuel-per-minute truck6) from 13 to 16
   goals met: 11 of 19
46. (drive-truck truck6 s5 s7 driver3)
   deleted: (at truck6 s5)
   added: (at truck6 s7)
   changed: (fuel-used) from 11488 to 12704
   goals met: 11 of 19
47. (unload-truck package8 truck6 s7)
   deleted: (in package8 truck6)
   added: (at package8 s7)
   changed: (load truck6) from 3 to 2, (fuel-per-minute truck6) from 16 to 13
   goals met: 12 of 19
48. (drive-truck truck6 s7 s8 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s8)
   changed: (fuel-used) from 12704 to 13731
   goals met: 12 of 19
49. (unload-truck package3 truck6 s8)
   deleted: (in package3 truck6)
   added: (at package3 s8)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 13 of 19
50. (drive-truck truck6 s8 s7 driver3)
   deleted: (at truck6 s8)
   added: (at truck6 s7)
   changed: (fuel-used) from 13731 to 14600
   goals met: 13 of 19
51. (drive-truck truck6 s7 s1 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s1)
   changed: (fuel-used) from 14600 to 15568
   goals met: 13 of 19
52. (unload-truck package4 truck6 s1)
   deleted: (in package4 truck6)
   added: (at package4 s1)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 14 of 19
53. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 14 of 19
54. (load-truck package12 truck6 s1)
   deleted: (at package12 s1)
   added: (in package12 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 14 of 19
55. (drive-truck truck1 s0 s7 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (fuel-used) from 15568 to 15748
   goals met: 13 of 19
56. (drive-truck truck6 s1 s7 driver3)
   deleted: (at truck6 s1)
   added: (at truck6 s7)
   changed: (fuel-used) from 15748 to 16716
   goals met: 13 of 19
57. (unload-truck package12 truck6 s7)
   deleted: (in package12 truck6)
   added: (at package12 s7)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 14 of 19
58. (drive-truck truck6 s7 s6 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s6)
   changed: (fuel-used) from 16716 to 16966
   goals met: 14 of 19
59. (drive-truck truck1 s7 s6 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   changed: (fuel-used) from 16966 to 17216
   goals met: 14 of 19
60. (board-truck driver2 truck2 s8)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 13 of 19
61. (disembark-truck driver1 truck1 s6)
   deleted: (driving driver1 truck1)
   added: (at driver1 s6) (empty truck1)
   goals met: 14 of 19
62. (drive-truck truck2 s8 s6 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s6)
   changed: (fuel-used) from 17216 to 17336
   goals met: 15 of 19
63. (disembark-truck driver2 truck2 s6)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 15 of 19
64. (walk driver2 s6 p8-6)
   deleted: (at driver2 s6)
   added: (at driver2 p8-6)
   goals met: 15 of 19
65. (walk driver2 p8-6 s8)
   deleted: (at driver2 p8-6)
   added: (at driver2 s8)
   goals met: 16 of 19
66. (drive-truck truck6 s6 s2 driver3)
   deleted: (at truck6 s6)
   added: (at truck6 s2)
   changed: (fuel-used) from 17336 to 17926
   goals met: 16 of 19
67. (drive-truck truck6 s2 s3 driver3)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   changed: (fuel-used) from 17926 to 18096
   goals met: 17 of 19
68. (board-truck driver1 truck1 s6)
   deleted: (at driver1 s6) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 16 of 19
69. (drive-truck truck1 s6 s7 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   changed: (fuel-used) from 18096 to 18346
   goals met: 16 of 19
70. (drive-truck truck1 s7 s0 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   changed: (fuel-used) from 18346 to 18526
   goals met: 17 of 19
71. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 17 of 19
72. (disembark-truck driver3 truck6 s3)
   deleted: (driving driver3 truck6)
   added: (at driver3 s3) (empty truck6)
   goals met: 17 of 19
73. (walk driver3 s3 p3-6)
   deleted: (at driver3 s3)
   added: (at driver3 p3-6)
   goals met: 17 of 19
74. (walk driver1 s0 p1-0)
   deleted: (at driver1 s0)
   added: (at driver1 p1-0)
   goals met: 17 of 19
75. (walk driver3 p3-6 s6)
   deleted: (at driver3 p3-6)
   added: (at driver3 s6)
   goals met: 18 of 19
76. (walk driver1 p1-0 s1)
   deleted: (at driver1 p1-0)
   added: (at driver1 s1)
   goals met: 18 of 19
77. (walk driver1 s1 p6-1)
   deleted: (at driver1 s1)
   added: (at driver1 p6-1)
   goals met: 18 of 19
78. (walk driver1 p6-1 s6)
   deleted: (at driver1 p6-1)
   added: (at driver1 s6)
   goals met: 19 of 19
